In [1]:
import pandas as pd

In [2]:
# There are 2 main data types. The first is called a Series
series = pd.Series(["BMW", "Toyota", "Honda"])

In [3]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [7]:
#Series are 1-dimensional
#Here's another example

In [5]:
colors = pd.Series(["Red","White","Blue"])

In [6]:
colors

0      Red
1    White
2     Blue
dtype: object

In [8]:
#The second data type is called a DataFrame
#DataFrames are 2-dimensional

In [13]:
car_data = pd.DataFrame({"Car_Make": series, "Color": colors})

In [14]:
car_data

  Car_Make  Color
0      BMW    Red
1   Toyota  White
2    Honda   Blue

In [16]:
#Import Data
#The above method of creating DataFrames can be tedious, so rather than combining different series into a dataframe,
#we can import data as a csv and convert that to a dataframe

In [17]:
car_sales = pd.read_csv("car-sales.csv")

In [18]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [19]:
#We can also export data using pandas

In [20]:
car_sales.to_csv("exported_car_sales.csv")

In [21]:
exported_car_sales = pd.read_csv("exported_car_sales.csv")
exported_car_sales

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

In [22]:
#You can see above that we have an extra column named Unnamed. This is referring to the index number from when we 
#exported the car sales data frame. 
#We can remove this unwanted column with one simple adjustment to the export command:

In [23]:
car_sales.to_csv("exported_car_sales.csv", index = False)
exported_car_sales = pd.read_csv("exported_car_sales.csv")
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [24]:
#As you can see, the above data frame does not have the extra index column from before.